abseil
aom
aribb24
asdf
azure-cli
bash
bashdb
bat
bear
boxes
brotli
btop
c-ares
ca-certificates
cairo
capstone
certifi
chafa
cjson
cmake
cmatrix
cocoapods
curl
dav1d
devcontainer
direnv
docker
docker-completion
dosbox-x
dotenv-linter
dotenvx
dtc
dust
expat
eza
fastfetch
fd
ffmpeg
ffmpegthumbnailer
figlet
fish
flac
fluid-synth
fmt
fontconfig
freetype
frei0r
fribidi
fvm
fzf
gdbm
gdk-pixbuf
gettext
gh
ghostscript
giflib
git
git-delta
git-series
gitleaks
gitmux
glib
glow
gmp
gnupg
gnutls
go
gpgme
graphite2
grpc
gum
harfbuzz
highway
hub
icu4c@75
icu4c@76
icu4c@77
imagemagick
imath
imlib2
intercept
jasper
jbig2dec
jpeg-turbo
jpeg-xl
jq
lame
lazydocker
lazygit
leptonica
libarchive
libass
libassuan
libavif
libb2
libbluray
libcaca
libde265
libdeflate
libevent
libgcrypt
libgit2
libgit2@1.8
libgpg-error
libheif
libidn
libidn2
libksba
liblqr
libmicrohttpd
libnghttp2
libogg
libomp
libpng
libraw
librist
librsvg
libsamplerate
libslirp
libsndfile
libsodium
libsoxr
libssh
libssh2
libtasn1
libtiff
libtommath
libtool
libunibreak
libunistring
libusb
libuv
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
libzip
little-cms2
lld
lld@19
llm
llvm
llvm@19
lolcat
lpeg
lua
lua@5.3
luajit
luarocks
luv
lynx
lz4
lzo
m4
markdown-toc
mbedtls
mise
mpdecimal
mpg123
ncurses
neovim
nettle
ninja
nlohmann-json
node
npth
nspr
nss
nushell
oh-my-posh
onefetch
oniguruma
opencore-amr
openexr
openjdk
openjdk@17
openjpeg
openssl@3
opus
p11-kit
pango
pcre2
pinentry
pipx
pixman
pkgconf
pngpaste
podman
poppler
portaudio
protobuf
pwgen
pyright
python-build
python-idna
python-packaging
python-tk@3.10
python-tk@3.12
python@3.10
python@3.12
python@3.13
qemu
ranger
rav1e
re2
readline
ripgrep
rtmpdump
rubberband
ruby
rust
sd
sdl2
serie
sevenzip
shared-mime-info
silicon
sloc
snappy
sonarqube-lts
spdlog
speex
sqlite
srt
starship
stow
svt-av1
task
taskwarrior-tui
tcl-tk
tcl-tk@8
tesseract
theora
tldr
toilet
tree-sitter
tty-solitaire
unbound
unibilium
usage
utf8proc
uv
vde
watch
webp
wget
x264
x265
xh
xorgproto
xvid
xz
yamllint
yazi
z3
zeromq
zig
zimg
zoxide
zstd
android-studio
calibre
font-hack-nerd-font
font-jetbrains-mono-nerd-font
font-symbols-only-nerd-font
ghostty
gimp
gstreamer-runtime
gzdoom
inkscape
karabiner-elements
kitty
leader-key
love
openscad
qutebrowser
raycast
signal
taskwarrior-pomodoro
utm
whatsapp
