aom
aribb24
asciiquarium
ast-grep
autoconf
bash
bat
bdw-gc
berkeley-db
berkeley-db@5
blueutil
boost
boxes
brotli
browsh
btop
c-ares
ca-certificates
cairo
chezmoi
cjson
cloc
clozure-cl
cmake
cmake-docs
cmatrix
cocoapods
dav1d
diff-so-fancy
difftastic
direnv
dos2unix
double-conversion
dust
elixir
erlang
eza
fastfetch
fb303
fbthrift
fd
ffmpeg
figlet
fish
fizz
flac
fmt
folly
fontconfig
freetype
frei0r
fribidi
fvm
fzf
gcc
gdbm
gettext
gflags
ghostscript
giflib
gifsicle
git-delta
git-lfs
gitmux
glib
glog
glow
gmp
gnutls
go
gradle
graphite2
guile
harfbuzz
highway
htmlq
htop
hugo
hunspell
hwloc
icu4c
imagemagick
imath
imlib2
isl
jasper
jbig2dec
jemalloc
jj
jless
jpeg-turbo
jpeg-xl
jq
json-c
kondo
lame
lazygit
lcov
leptonica
libarchive
libass
libb2
libbluray
libcaca
libde265
libev
libevent
libgit2
libheif
libid3tag
libidn
libidn2
libkeccak
liblqr
libmicrohttpd
libmp3splt
libmpc
libnghttp2
libogg
libomp
libpng
libpthread-stubs
libraw
librist
libsamplerate
libsndfile
libsodium
libsoxr
libssh
libssh2
libtasn1
libtiff
libtool
libunibreak
libunistring
libuv
libvidstab
libvmaf
libvorbis
libvpx
libvterm
libwebsockets
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
libzip
little-cms2
lolcat
lorem
lpeg
lua
luajit
luv
lynx
lz4
lzo
m4
mad
marp-cli
mbedtls
midnight-commander
mp3splt
mpdecimal
mpfr
mpg123
msgpack
mujs
mupdf
navi
ncurses
neofetch
neovim
nettle
newsboat
nghttp2
ninja
node
numpy
oh-my-posh
oniguruma
openblas
opencore-amr
openexr
openjdk
openjpeg
openssl@3
openvino
opus
p11-kit
p7zip
pandoc
pango
pcre
pcre2
perl
pixman
pkg-config
poke
pugixml
python-packaging
python@3.12
r
rav1e
rbenv
rcm
readline
ripgrep
rubberband
ruby
ruby-build
s-lang
sbcl
screenresolution
sdl2
sevenzip
sha3sum
shared-mime-info
shellcheck
silicon
sloc
snappy
speex
sqlite
srt
stow
stylua
svt-av1
syncthing
tbb
tcl-tk
tesseract
texinfo
thefuck
theora
tig
tldr
tlrc
tmux
toilet
tree
tree-sitter
ttyd
unbound
unibilium
unixodbc
utf8proc
vhs
vifm
wangle
watch
watchman
webp
wget
wxwidgets
x264
x265
xh
xorgproto
xvid
xz
yazi
yq
zellij
zeromq
zimg
zoxide
zsh-autocomplete
zsh-autosuggestions
zsh-syntax-highlighting
zstd
zsync
alacritty
font-awesome-terminal-fonts
gitkraken-cli
iterm2
kitty
logseq
manuskript
mp3tag
raycast
rectangle
scribus
unicopedia-plus
wezterm
xquartz
yacreader
