tap "arl/arl"
tap "dotenvx/brew"
tap "hashicorp/tap"
tap "leoafarias/fvm"
tap "lusingander/tap"
tap "sst/tap"
# Record and share terminal sessions
brew "asciinema"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bash shell debugger
brew "bashdb"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Generate compilation database for clang tooling
brew "bear"
# Binary editor written in Go
brew "bed"
# Draw boxes around text
brew "boxes"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Platform built on V8 to build network applications
brew "node"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# DOSBox with accurate emulation and wide testing
brew "dosbox-x"
# Lightning-fast linter for .env files written in Rust
brew "dotenv-linter"
# Terminal document viewer for .docx files
brew "doxx"
# More intuitive version of du in rust
brew "dust"
# XML 1.0 parser
brew "expat"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Track changes to a patch series over time
brew "git-series"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# Plays the game of Go
brew "gnu-go"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# GNU troff text-formatting system
brew "groff"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Static Application Security Testing (SAST) tool
brew "intercept"
# Interactive computing in Python
brew "ipython"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# TUI for Jujutsu/jj
brew "lazyjj"
# LLVM Project Linker
brew "lld"
# Access large language models from the command-line
brew "llm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# Generate a markdown TOC (table of contents) with Remarkable
brew "markdown-toc"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# FTP client with an advanced user interface
brew "ncftp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Modern shell for the GitHub era
brew "nushell"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Command-line Git information tool
brew "onefetch"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Port of pdftk in java
brew "pdftk-java"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Paste PNG into files
brew "pngpaste"
# Tool for managing OCI containers and pods
brew "podman"
# Cowsay but with ponies
brew "ponysay"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Show ps output as a tree
brew "pstree"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Password generator
brew "pwgen"
# Static type checker for Python
brew "pyright"
# Simple, correct PEP 517 build frontend
brew "python-build"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Create beautiful image of your source code
brew "silicon"
# Simple tool to count source lines of code
brew "sloc"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ncurses-based klondike solitaire game
brew "tty-solitaire"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# A rich git commit graph in your terminal, like magic
brew "lusingander/tap/serie"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Tools for building Android applications
cask "android-studio"
# E-books management software
cask "calibre"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Screen annotation tool
cask "drawpen"
# Software to layout and print images with Epson printers
cask "epson-print-layout"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Adds an OpenGL renderer to the ZDoom source port
cask "gzdoom"
# Vector graphics editor
cask "inkscape"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# 2D game framework for Lua
cask "love"
# Programmable solid 3D CAD modeller
cask "openscad"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Run commands and display their output on the desktop
cask "ubersicht"
# Virtual machines UI using QEMU
cask "utm"
# Virtualization tool
cask "virtualbuddy"
# Multimedia player
cask "vlc"
# Free and open-source real time strategy game
cask "warzone-2100"
# Native desktop client for WhatsApp
cask "whatsapp"
