tap "arl/arl"
tap "dotenvx/brew"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "lusingander/tap"
brew "asdf"
brew "python@3.12"
brew "azure-cli"
brew "bashdb"
brew "libgit2"
brew "bat"
brew "bear"
brew "boxes"
brew "btop"
brew "icu4c@76"
brew "chafa"
brew "cmake"
brew "cmatrix"
brew "cocoapods"
brew "curl"
brew "node"
brew "devcontainer"
brew "direnv"
brew "docker"
brew "dosbox-x"
brew "dotenv-linter"
brew "dust"
brew "expat"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "figlet"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-series"
brew "gitleaks"
brew "glow"
brew "go"
brew "gum"
brew "hub"
brew "imagemagick"
brew "intercept"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "llvm"
brew "lld"
brew "llm"
brew "lolcat"
brew "lua"
brew "lua@5.3"
brew "luarocks"
brew "lynx"
brew "markdown-toc"
brew "mise"
brew "neovim"
brew "ninja"
brew "nushell"
brew "oh-my-posh"
brew "onefetch"
brew "openjdk"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "podman"
brew "poppler"
brew "pwgen"
brew "pyright"
brew "python-build"
brew "python-idna"
brew "python@3.10"
brew "python-tk@3.10"
brew "python-tk@3.12"
brew "qemu"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "sd"
brew "sevenzip"
brew "silicon"
brew "sloc"
brew "sonarqube-lts"
brew "starship"
brew "stow"
brew "taskwarrior-tui"
brew "tldr"
brew "toilet"
brew "tty-solitaire"
brew "uv"
brew "watch"
brew "wget"
brew "xh"
brew "yamllint"
brew "yazi"
brew "zig"
brew "zoxide"
brew "arl/arl/gitmux"
brew "dotenvx/brew/dotenvx"
brew "leoafarias/fvm/fvm"
brew "lusingander/tap/serie"
cask "android-studio"
cask "calibre"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gimp"
cask "gstreamer-runtime"
cask "gzdoom"
cask "inkscape"
cask "karabiner-elements"
cask "kitty"
cask "leader-key"
cask "love"
cask "openscad"
cask "qutebrowser"
cask "raycast"
cask "signal"
cask "taskwarrior-pomodoro"
cask "utm"
cask "whatsapp"
